# DocumentEntryPoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint Properties
DocumentEntryPoint Class See Also
---
The DocumentEntryPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveGraphicalView | The currently active graphical view of the currently active document.  (Inherited from UIDocument.) |
| ActiveView | The currently active view of the currently active document.  (Inherited from UIDocument.) |
| AddinFolder | The full path to the Revit Macros module. |
| Application | Retrieves an object that represents the current Application. (Inherited from UIDocument.) |
| Document | Returns the database level document represented by this UI-level document. (Inherited from UIDocument.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from UIDocument.) |
| Selection | Retrieve the currently selected Elements in Autodesk Revit. (Inherited from UIDocument.) |

# See Also
DocumentEntryPoint Class
Autodesk.Revit.UI.Macros Namespace